USE python_study;

-- --------------------------------- 统计数目 COUNT ---------------------------------
SELECT COUNT(name) 姓名总数
FROM table_name;

-- --------------------------------- 最大值 MAX ---------------------------------
SELECT MAX(age) 最大值
FROM table_name;

-- --------------------------------- 最小值 MIN ---------------------------------
SELECT MIN(age) 最小值
FROM table_name;

-- --------------------------------- 平均值 AVG ---------------------------------
SELECT AVG(age) 平均值
FROM table_name;

-- --------------------------------- 总和 SUM ---------------------------------
SELECT SUM(age) 总和
FROM table_name;
